Diagram  part was done
